In [1]:
# Imports
import pandas as pd

In [7]:
# Read data
df_aisles = pd.read_csv("../data/aisles.csv")
df_departments = pd.read_csv("../data/departments.csv")
df_orders = pd.read_csv("../data/orders.csv")
df_products = pd.read_csv("../data/products.csv")
df_order_products_train = pd.read_csv("../data/order_products__train.csv")
df_order_products_prior = pd.read_csv("../data/order_products__prior.csv")

In [3]:
# Peeking into dataframes
df_aisles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [25]:
# Peeking into dataframes
df_departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [4]:
# Peeking into dataframes
df_orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [27]:
# Peeking into dataframes
df_products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [6]:
df_order_products_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [8]:
df_order_products_train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [18]:
# Orders and customer split
df_orders.groupby("eval_set").nunique()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
eval_set,,,,,,,
prior,3214874,206209,1,99,7,24,31
test,75000,75000,1,97,7,24,31
train,131209,131209,1,97,7,24,31

In [ ]:
df_orders.group